
#ifndef _ALARM_CLASS_
#define _ALARM_CLASS_

enum AlarmStatus {
					ALARM_ENDED,	//0
					ALARM_STARTED,	//1
					ALARM_REPORTED,	//2
					ALARM_ACK,		//3					

};

enum ReamStatus{
					REMA_NONE,		//0
					REMA_SEND,		//1
					REMA_REPORT,	//2
};

//GetDetails flags
#define GET_DETAILS_CATEGORY		0x00001	
#define GET_DETAILS_SUB_CATEGORY	0x00002	


// AlarmSrv Event flags
#define ALARM_EVENT_INFORM_ON_NEXT_ALARM      0x000001  // This event inform on update next exist alarm to delete group



#define CONFIGURATION_XML_FILE_NAME		"C:\\Program Files\\Retalix\\AlarmSrv\\AlarmSrv.xml"
#define CONFIGURATION_PATH_NAME			"C:\\Program Files\\Retalix\\AlarmSrv"
#define XML_FILES_PATH					"C:\\Program Files\\Retalix\\AlarmSrv\\Alarms"

// DataBase type 
#define DATA_BASE_INI_FILE		 0
#define DATA_BASE_XML_FILE		 1

// 1.0.0.30
#define FILE_CONFIGURATION_INI   "\\AlarmCfg.ini"
#define FILE_CONFIGURATION_XML   "\\AlarmCfg.xml"

#define FILE_ALARMSRV_RUNTIME_INI  "\\AlarmSrvRunTimeFile.ini"

// fields size
#define MAX_DESC_LEN				100    //1.0.0.13
#define MAX_APPLICATION_IDENTIFIER  50 

#define MAX_ALARM_DESC_LEN          MAX_DESC_LEN 
#define MAX_ALARM_ID				12
#define MAX_SERVER_NAME				100
#define	MAX_TABLE_NAME				100
#define MAX_PATH_NAME				MAX_SERVER_NAME+MAX_TABLE_NAME
#define MAX_REC_VALUES				1000


#define MAX_CATEGORY_DESCRIPTION	50

// Alarm end type
#define ALARM_END_TYPE_BY_OK		0
#define ALARM_END_TYPE_BY_TIME_OUT	1
#define ALARM_END_TYPE_BY_ACK		2

//Flags for the GAI::GetAlarm(...) methode.
#define ALL_ALARMS		0x0000
#define	FIRST_ALARM		0x0001
#define	NEXT_ALARM		0x0002

//Alarm status
#define ALARM_OFF		0
#define ALARM_ON		1
#define ALARM_DELETE	2
#define ALARM_ACK		3


// sort type.
#define IGNORE_CATEGORY_NUMBER			0
#define IGNORE_SUB_CATEGORY_NUMBER		0
#define IGNORE_DEVICE_NUMBER			0
#define IGNORE_ALARM_NUMBER				0


// retrieve data flags
#define GET_DIRECT_INDEX	1 
#define GET_FIRST_INDEX		2 
#define GET_NEXT_INDEX		3 

// Alarm types
#define ALARM_TYPE_UNDEFINE	0
#define ALARM_TYPE_WARNING	1
#define ALARM_TYPE_ERROR	2
#define ALARM_TYPE_MISC		3  


// Get Alarm by Category flags. 
#define GABC_ONLY_DISPLAY_MESSAGES						0x00000001
#define GABC_WITHOUT_SOFTWARE_GENERAL_OLA_ERR			0x00000002		//1.0.20.0


#define MAINTENANCE_PROCESS_TIME_OUT			1800 //(half hour  * 1000)
#define MAINTENANCE_XML_SAMPLE_FACTOR			60000

enum GAIRetCode {

			GAI_OK,							// 0
			GAI_INVALID_CATEGORY_NUMBER,	// 1
			GAI_INVALID_SUBCATEGORY_NUMBER,	// 2
			GAI_INVALID_ALARM_NUMBER,		// 3
			GAI_INVALID_DEVICE_NUMBER,		// 4
			GAI_INVALID_ALARM_STATUS,		// 5
			GAI_ALARM_NOT_FOUND,			// 6
			GAI_INVALID_PARAMETER,			// 7
			
				
};

enum AlarmSrvCtrlRetCode
{
	ALARMSRV_CTRL_OK = 0,
	ALARMSRV_CTRL_FAILED_TO_OPEN_TABLE,
	ALARMSRV_CTRL_PARAM_NOT_FOUND,
	ALARMSRV_CTRL_TABLE_NAME_TOO_LONG,
	ALARMSRV_CTRL_FIELD_NAME_TOO_LONG,
	ALARMSRV_CTRL_DEFAULT_FIELD_VAL_TOO_LONG,
	ALARMSRV_CTRL_LAST_ERROR,
	ALARMSRV_CTRL_CATEGORY_NOT_VALID,
	ALARMSRV_CTRL_SUB_CATEGORY_NOT_VALID,	
};
	
enum MailSrvStatusSend
{
    MAIL_SEND_ALWAYS,        //0
	MAIL_SEND_ON_CREATE,     //1
	MAIL_SEND_ON_DELETE,     //2
};

//1.0.13.500
enum CreateXmlOnStatus {
	XML_ON_CREATE_AND_DELETE, //0
	XML_ON_CREATE,			  //1
	XML_ON_DELETE,			  //2
};

//1.0.22.0 - TD 70576
enum EventSendStatus {
	EVENT_SEND_ON_CREATE_AND_DELETE,  //0
	EVENT_SEND_ON_CREATE,			  //1
	EVENT_SEND_ON_DELETE,			  //2
};

#pragma pack(1)


typedef struct
{
	BYTE  sCategoryID[2];
	BYTE  sCategoryDes[MAX_CATEGORY_DESCRIPTION]; 
}CATEGORY_DETAILS;


typedef  struct
{
	BYTE	sCaterory[2];
	BYTE	sSubCaterory[2];  
	BYTE	sAlarmNumber[3];  //4.0.8.500
 	BYTE	sDevice[3];       //4.0.8.500
	BYTE	sStatus[2];
	BYTE	sDescription[MAX_DESC_LEN];
	BYTE	sAlarmId[11];
	BYTE	sAlarmType[2];
	BYTE	sRightAlignment[2];
	BYTE	sAlarmPriority[2];  //1.0.0.13
	BYTE	sAlarmEndType[2];
	BYTE	sShowAckUI[2];		//1.0.15.500 - CR 34668
	BYTE	sSendToWMI[2];		//1.0.19.500 (TD 60465)
	BYTE	sSendToEventViewer[2]; //1.0.22.0 - TD 70576
	BYTE    sFiler[72];			//1.0.22.0 - TD 70576
	//BYTE    sFiler[74];		//1.0.19.500 (TD 60465)
	//BYTE    sFiler[76];	
	//BYTE    sFiler[78];		//1.0.15.500
	//BYTE    sFiler[80];		//1.0.9.500	
} ALARM_CATEGORY_INFO;

typedef  struct
{
	DWORD	m_lAlarmId;								// 0 - 3
	SYSTEMTIME m_cUpdateTime;						// 4 - 19	
	SYSTEMTIME m_cStartTime;						//20 - 35
	SYSTEMTIME m_cCurrStateTime;					//36 - 51	
	LONG	m_lAlarmCategory;						//52 - 55
	LONG	m_lAlarmSubCategory;					//56 - 59
	LONG	m_lAlarmNumber;							//60 - 63
	LONG	m_lDeviceNumber;						//64 - 67
	LONG	m_lState ;								//68 - 71
	LONG	m_lAlarmPriority;						//72 - 75
	BYTE	m_szAlarmDescription[MAX_DESC_LEN];		//76 - 175
	BOOL	m_bSendToREMA;							//176- 179  
	BOOL	m_bSendToClient;						//180- 183
	LONG	m_lAlarmEndedType;						//184- 187 
	LONG	m_lAlarmTimeOut;						//188- 191
	LONG	m_lAlarmType;							//192- 195
	LONG	m_lMatrixMemberId;						//196- 199
	LONG	m_lStoreInternalId;						//200- 203	
	LONG	m_lRemaComponentId;						//204- 207			
	LONG	m_lRemaAlertId;							//208- 211
	BYTE	m_szApplicationIdentifier[MAX_DESC_LEN];//212- 311
	BOOL	m_bCreateXMLFile;						//312- 315	1.0.0.12
	BOOL	m_bSaveToDataBase;						//316- 319
	BOOL	m_bRightAlignment;						//320- 323
	LONG	m_lAlarmValue;							//324- 327	
	LONG	m_lSendEmailToGroup;					//328- 331	 //1.0.0.22	
	LONG	m_lSendEmailOnStatus;					//332 - 335 1.0.0.26
	LONG	m_lSeqNumber;							//336 - 339	
	BOOL	m_bAddToTextFile;						//340- 343	
	LONG	m_lDistributionTimeout;					//344- 347 //1.0.12.60
	BOOL	m_bSendToMSMQ;							//348- 351 //1.0.12.501		
	BOOL	m_bIsDistributed;						//352- 355
	LONG	m_lCreateXmlOnStatus;					//356- 359 //1.0.13.500
	BOOL	m_bDoNotCreateXmlFileOnAck;				//360- 363  //1.0.15.500 - CR 34668
	BOOL	m_bShowAckUI;							//364- 367  //1.0.15.500 - CR 34668	
	BOOL	m_bSendToWMI;							//368- 371	//1.0.19.500 (TD 60465)
	BOOL	m_bSendToEventViewer;					//372- 375	//1.0.22.0 - TD 70576
	LONG	m_lSendToEventViewerOnStatus;			//376- 379	//1.0.22.0 - TD 70576
	LONG	m_lEventViewerId;						//380- 383	//1.0.22.0 - TD 70576
	BOOL	m_bAddMachineAliasNameToFileName;		//384- 387	//4.0.24.90
	LONG	m_lMaxAlarmCounter;						//388- 391	//TD 162766
	LONG	m_lSnoozeInterval;  					//388- 391  // 1.0.28.501 - TD 123988
	LONG	m_lSnoozeAttempts;  					//392- 395  // 1.0.28.501 - TD 123988  
